TOOL:	xrun	19.09-s003: Started on Oct 29, 2020 at 23:24:05 CET
xrun
	-f dut.f
		mtm_Alu.vp
	-f tb.f
		alu_tb.sv
	-v93
	+nowarnDSEM2009
	+nowarnDSEMEL
	+nowarnCGDEFN
	-xmlibdirname INCA_libs_gui
	+access+r
	+gui
	+overwrite
	-nocopyright
	-coverage all
	-covoverwrite
	-covfile xrun_covfile.txt
	-covtest lab01
	-l xrun_gui.log

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /cad/XCELIUM1909/tools/xcelium/files/xmsimrc
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm top_TB.A_data top_TB.B_data top_TB.clk top_TB.sin top_TB.sout
Created probe 1
xcelium> run
Simulation complete via $finish(1) at time 32320 NS + 0
./alu_tb.sv:398 	$finish;
xcelium> probe -create -shm top_TB.tester.opcode_set
Created probe 2
xcelium> probe -create -shm top_TB.calc_crc_4b.crc_out
Created probe 3
xcelium> reset
xmsim: *W,C58RST: Reset command executed. Coverage is enabled for the subsequent simulation run.  The coverage test name needs to be changed to prevent data overwrite, and any coverage control commands previously used must be reissued.
Loaded snapshot worklib.top_TB:sv
xcelium> run
Simulation complete via $finish(1) at time 32320 NS + 0
./alu_tb.sv:398 	$finish;
xcelium> 