TOOL:	xrun	19.09-s003: Started on Oct 18, 2020 at 01:16:27 CEST
xrun
	-f dut.f
		tinyalu_dut/single_cycle_add_and_xor.vhd
		tinyalu_dut/three_cycle_mult.vhd
		tinyalu_dut/tinyalu.vhd
	-f tb.f
		tinyalu_tb.sv
	-v93
	+nowarnDSEM2009
	+nowarnDSEMEL
	+nowarnCGDEFN
	-xmlibdirname INCA_libs_gui
	+access+r
	+gui
	+overwrite
	-nocopyright
	-coverage all
	-covoverwrite
	-covfile xrun_covfile.txt
	-covtest lab01
	-l xrun_gui.log

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /cad/XCELIUM1909/tools/xcelium/files/xmsimrc
xcelium> run
Simulation complete via $finish(1) at time 29940 NS + 0
./tinyalu_tb.sv:235       $finish;
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm top.A top.B top.clk top.done top.op top.op_set top.reset_n top.result top.start top.DUT:add_and_xor:A top.DUT:add_and_xor:B top.DUT:add_and_xor:clk top.DUT:add_and_xor:done_aax top.DUT:add_and_xor:done_aax_int top.DUT:add_and_xor:op top.DUT:add_and_xor:reset_n top.DUT:add_and_xor:result_aax top.DUT:add_and_xor:start
Created probe 1
xcelium> scope -set top
xcelium> probe -create -shm top.scoreboard.predicted_result
Created probe 2
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> reset
xmsim: *W,C58RST: Reset command executed. Coverage is enabled for the subsequent simulation run.  The coverage test name needs to be changed to prevent data overwrite, and any coverage control commands previously used must be reissued.
Loaded snapshot worklib.top:sv
xcelium> run
Simulation complete via $finish(1) at time 29940 NS + 0
./tinyalu_tb.sv:235       $finish;
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
See ./cov_work/scope/test/icc.com file for message(s) on coverage constant object marking

coverage setup:
  workdir  :  ./cov_work
  dutinst  :  top(top)
  scope    :  scope
  testname :  test

coverage files:
  model(design data) :  ./cov_work/scope/icc_208e7250_5f931956.ucm
  data               :  ./cov_work/scope/test/icc_208e7250_5f931956.ucd
TOOL:	xrun	19.09-s003: Exiting on Oct 18, 2020 at 01:33:01 CEST  (total: 00:16:34)
